Revit 2027 API
DistributionSysTypeSet Constructor
Initializes a new instance of the DistributionSysTypeSet class
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DistributionSysTypeSet()
Public Sub New
public:
DistributionSysTypeSet()
new : unit -> DistributionSysTypeSet
See Also
Reference
DistributionSysTypeSet Class
Autodesk.Revit.DB.Electrical Namespace